<?php

header('Content-type: text/html; charset=utf-8');
/*
 * Небольшой пример использования библиотеки
 * 1. Шаг подключаем библиотеку
 */
require '../Library/NCL.NameCase.ru.php';
/*
 * 2. Создаем объект
 */
$nc = new NCLNameCaseRu();
/*
 * =========================
 * Встроенные константы
 * =========================
 * NCLNameCaseRu::$IMENITLN - именительный падеж
 * NCLNameCaseRu::$RODITLN - родительные падеж
 * NCLNameCaseRu::$DATELN - дательные падеж
 * NCLNameCaseRu::$VINITELN - винительный падеж
 * NCLNameCaseRu::$TVORITELN - творительный падеж
 * NCLNameCaseRu::$PREDLOGN - предложный падеж
 */

echo 'Отчет, ' .
 $nc->q("Афонин Николай Сергеевич", NCLNameCaseRu::$RODITLN)
 . ' о проделаной работе вместе с его сыном ' .
 $nc->q("Афонин Никита", NCLNameCaseRu::$TVORITELN) .
 ' на осенних каникулах. Задание держалось на ' .
 $nc->q("Маргаритта Николаевна", NCLNameCaseRu::$PREDLOGN) .
 '; Поздравляем всех предчастных, в том числе и ' .
 $nc->q("Кардонский Серафим Ильич", NCLNameCaseRu::$VINITELN) . ' и ' .
 $nc->q("Лобудская София Викторовна", NCLNameCaseRu::$VINITELN) .
 '. Хотим передать поздравление также ' .
 $nc->q("Игнатьев Павел Викторович", NCLNameCaseRu::$DATELN) . ' и ' .
 $nc->q("Сумарский Лев", NCLNameCaseRu::$DATELN);

/*
 * ========================
 * Результат выполнения
 * ========================
 * Отчет, Афонина Николая Сергеевича о проделаной работе вместе с его сыном Афониным Никитой на осенних каникулах. Задание держалось на Маргаритте Николаевне; Поздравляем всех предчастных, в том числе и Кардонского Серафима Ильича и Лобудскую Софию Викторовну. Хотим передать поздравление также Игнатьеву Павлу Викторовичу и Сумарскому Льву
 */





